In [4]:
import pandas as pd

In [12]:
aal_clean_df = pd.read_csv('AAL_clean.csv')
bac_clean_df = pd.read_csv('BAC_clean.csv')
dal_clean_df = pd.read_csv('DAL_clean.csv')
sp500_clean_df = pd.read_csv('S&P500_clean.csv')
wfc_clean_df = pd.read_csv('WFC_clean.csv')
aal_clean_df = aal_clean_df[['Date','AAL']]
bac_clean_df = bac_clean_df[['Date','BAC']]
dal_clean_df = dal_clean_df[['Date','DAL']]
sp500_clean_df = sp500_clean_df[['Date','S&P500']]
wfc_clean_df = wfc_clean_df[['Date','WFC']]

In [13]:
clay_merged_df1 = pd.merge(aal_clean_df,bac_clean_df, on="Date")
clay_merged_df1.head()

         Date       AAL        BAC
0  2010-01-01  5.005957  13.460909
1  2010-02-01  6.910295  14.773309
2  2010-03-01  6.929150  15.828542
3  2010-04-01  6.665183  15.820416
4  2010-05-01  8.324407  13.965980

In [15]:
clay_merged_df2 = pd.merge(dal_clean_df,sp500_clean_df, on="Date")
clay_merged_df2.head()

         Date        DAL       S&P500
0  2010-01-01  10.863926  1073.869995
1  2010-02-01  11.476853  1104.489990
2  2010-03-01  12.960317  1169.430054
3  2010-04-01  10.730680  1186.689941
4  2010-05-01  12.063131  1089.410034

In [18]:
clay_merged_df3 = pd.merge(clay_merged_df1,clay_merged_df2, on="Date")
clay_merged_df3.head()

         Date       AAL        BAC        DAL       S&P500
0  2010-01-01  5.005957  13.460909  10.863926  1073.869995
1  2010-02-01  6.910295  14.773309  11.476853  1104.489990
2  2010-03-01  6.929150  15.828542  12.960317  1169.430054
3  2010-04-01  6.665183  15.820416  10.730680  1186.689941
4  2010-05-01  8.324407  13.965980  12.063131  1089.410034

In [21]:
clay_finalmerged_df = pd.merge(clay_merged_df3,wfc_clean_df, on="Date")
clay_finalmerged_df.head()

         Date       AAL        BAC        DAL       S&P500        WFC
0  2010-01-01  5.005957  13.460909  10.863926  1073.869995  21.231312
1  2010-02-01  6.910295  14.773309  11.476853  1104.489990  20.417307
2  2010-03-01  6.929150  15.828542  12.960317  1169.430054  23.280611
3  2010-04-01  6.665183  15.820416  10.730680  1186.689941  24.769310
4  2010-05-01  8.324407  13.965980  12.063131  1089.410034  21.462746

In [23]:
len(clay_finalmerged_df)

120

In [24]:
clay_finalmerged_df.to_csv('Clay_dataclean.csv', encoding="utf-8", index=False)